{
  "meta": {
    "year": 2026,
    "source": "Bruce Feldman's Freaks List",
    "article_url": "https://www.nytimes.com/athletic/7065727/2026/02/25/nfl-draft-2026-combine-breakout-prospects-must-watch/"
  },
  "freaks": [
    {
      "rank": 1,
      "first_name": "Kenyon",
      "last_name": "Sadiq",
      "college": "Oregon",
      "position": "TE",
      "description": "Junior from Idaho who arrived in Eugene at 220 lbs. Vertical jumped 41.5 inches, bench pressed 435 lbs, power cleaned 365 lbs while weighing 255 lbs. Ranked No. 11 on 2025 Freaks List. Expected to be lighter at the combine with even higher vertical and eye-popping speed and agility numbers."
    },
    {
      "rank": 2,
      "first_name": "Sonny",
      "last_name": "Styles",
      "college": "Ohio State",
      "position": "LB",
      "description": "At 6-4, 243 lbs, broad jumped 11-0 and vertical jumped 40 inches. Topped 23 MPH on GPS, clocking 23.2 MPH. Expected to out-jump teammate Arvell Reese in both vertical and broad jump."
    },
    {
      "rank": 3,
      "first_name": "Kendrick",
      "last_name": "Law",
      "college": "Kentucky",
      "position": "WR",
      "description": "6-0, 203 lbs. Built more like a running back. Bench pressed 465 lbs and squatted 655 lbs while at Alabama. Hit 23.2 mph with elite explosiveness. Expected to run the 40 in high 4.2s. No. 14 on the 2024 Freaks List. Had 53 catches for 530 yards and 3 TDs at Kentucky."
    },
    {
      "rank": 4,
      "first_name": "Jack",
      "last_name": "Kelly",
      "college": "BYU",
      "position": "LB",
      "description": "6-2, 242 lbs. Former BMX dirt bike champion. Had 13.5 TFLs, 10 sacks and 2 forced fumbles in 2025. Expected to run 40 in low 4.5s. Should excel in shuttles with elite short-area quickness, around 4.00 in short shuttle. No LB has clocked under 4.23 in five years at the combine."
    },
    {
      "rank": 5,
      "first_name": "Zane",
      "last_name": "Durant",
      "college": "Penn State",
      "position": "DT",
      "description": "6-1, 290 lbs. No. 8 on 2025 Freaks List. Ran 4.66 60-yard dash with 4.43 shuttle. Bench pressed 425 lbs and squatted 660 lbs. Expected to weigh around 295 lbs at combine. Recently ran a blazing 1.62-second 10-yard split."
    },
    {
      "rank": 6,
      "first_name": "David",
      "last_name": "Bailey",
      "college": "Texas Tech",
      "position": "EDGE",
      "description": "6-3, 250 lbs. Stanford transfer. Had 14.5 sacks, 19.5 TFLs, 3 forced fumbles. Elite burst off the edge. Hit 22.16 mph and bench pressed 405 lbs. Film is just as impressive as his testing numbers."
    },
    {
      "rank": 7,
      "first_name": "Eli",
      "last_name": "Stowers",
      "college": "Vanderbilt",
      "position": "TE",
      "description": "6-4, 235 lbs. Former four-star QB recruit who blossomed after switching positions. Former Texas 6A state high-jump champion. No. 15 on 2025 Freaks List. Broad jumped 11-3, vertical jumped 39 inches, power cleaned 360 lbs. May vertical north of 40 inches at combine."
    },
    {
      "rank": 8,
      "first_name": "Kadyn",
      "last_name": "Proctor",
      "college": "Alabama",
      "position": "OL",
      "description": "6-7, 366 lbs. No. 2 on 2025 Freaks List. Vertical jumped 32 inches and broad jumped 9-3 at that size. Squatted 815 lbs, bench pressed 535 lbs, power cleaned 405 lbs. His vertical matched Colorado's LaJohntay Wester, who weighed 203 lbs less."
    },
    {
      "rank": 9,
      "first_name": "Arvell",
      "last_name": "Reese",
      "college": "Ohio State",
      "position": "EDGE",
      "description": "6-4, 243 lbs. 69 tackles and 6.5 sacks in 2025. Some Big Ten coaches felt he was the biggest problem, not star safety Caleb Downs. Expected to broad jump close to 11 feet, vertical around 40 inches, and run in the 4.4s. Won't turn 21 until end of August."
    },
    {
      "rank": 10,
      "first_name": "Peter",
      "last_name": "Woods",
      "college": "Clemson",
      "position": "DL",
      "description": "6-3, 310 lbs. Top-five on 2025 Freaks List. Ran 4.86 40 with 33-inch vertical. Bench pressed 490 lbs and 34 reps at 225. Power cleaned 385 lbs and squatted 700 lbs."
    },
    {
      "rank": 11,
      "first_name": "Ted",
      "last_name": "Hurst",
      "college": "Georgia State",
      "position": "WR",
      "description": "6-3, 198 lbs. No. 83 on 2025 Freaks List. Impressive Senior Bowl showing. Spent two seasons at Valdosta State. Had 71 catches for 1004 yards and 6 TDs. Ran laser-timed 4.51 40, broad jumped 10-8, 3-cone time of 6.93. Expected to top those numbers at the combine."
    },
    {
      "rank": 12,
      "first_name": "Deion",
      "last_name": "Burks",
      "college": "Oklahoma",
      "position": "WR",
      "description": "5-9, 190 lbs. Former Purdue wideout, two-time Freaks List selection. 57 catches for 620 yards and 4 TDs in 2025. Exceptionally strong for a wideout, bench pressed 400 lbs. Expected to run in the 4.3s and soar in jump tests."
    },
    {
      "rank": 13,
      "first_name": "Logan",
      "last_name": "Jones",
      "college": "Iowa",
      "position": "C",
      "description": "6-1, 303 lbs. No. 7 on 2025 Freaks List. Former high school basketball standout. Set Iowa program record with 705-lb squat. Holds position records: 36.6-inch vertical, 1.53 10-yard split, 4.09 shuttle. 470-lb hang clean is also a position record."
    },
    {
      "rank": 14,
      "first_name": "Brenen",
      "last_name": "Thompson",
      "college": "Mississippi State",
      "position": "WR",
      "description": "5-9, 170 lbs. No. 91 on 2025 Freaks List. Top pick to run fastest 40 at the combine. Former high school QB who won Texas 3A 200-meter title running 21.27. Clocked 23.7 mph. Transfer from Oklahoma. Breakout 2025 season: 57 catches for 1,054 yards and 6 TDs."
    },
    {
      "rank": 15,
      "first_name": "Jake",
      "last_name": "Golday",
      "college": "Cincinnati",
      "position": "LB",
      "description": "6-4.5, 240 lbs. No. 48 on 2025 Freaks List. Began career at Central Arkansas. Ran 4.24 shuttle (faster than any LB at 2025 combine). Broad jumped 10-7 (would have been second-best). 36-inch vertical, 1.54-second 10-yard split, 24 reps of 225 on bench."
    },
    {
      "rank": 16,
      "first_name": "Jeff",
      "last_name": "Caldwell",
      "college": "Cincinnati",
      "position": "WR",
      "description": "6-4, 208 lbs. Transfer from Division II Lindenwood. Broad jumped 11-9 (seven inches longer than any WR at 2025 combine). 32 catches for 478 yards and 6 TDs. Vertical jumped 36.5 inches. Expected to still broad jump over 11 feet at combine."
    },
    {
      "rank": 17,
      "first_name": "Justin",
      "last_name": "Jefferson",
      "college": "Alabama",
      "position": "LB",
      "description": "6-1, 218 lbs. Second on the Tide with 85 tackles, 6.5 TFLs and 3 sacks in 2025. Expected to be the fastest linebacker in Indianapolis and one of the fastest players at the combine. May run the 40 in high 4.3s."
    },
    {
      "rank": 18,
      "first_name": "Bryce",
      "last_name": "Lance",
      "college": "North Dakota State",
      "position": "WR",
      "description": "6-3, 207 lbs. Trey Lance's younger brother. No. 34 on 2025 Freaks List. Set NDSU record with 17 TD receptions in 2024 (led FCS). In 2025: 51 catches for 1,079 yards and 8 TDs, averaging 21.2 yards per catch. Vertical jumped 40 inches, broad jumped 10-10."
    },
    {
      "rank": 19,
      "first_name": "Domonique",
      "last_name": "Orange",
      "college": "Iowa State",
      "position": "DT",
      "description": "6-4, 325 lbs. No. 25 on 2025 Freaks List. Bench pressed 450 lbs and vertical jumped 34 inches. Had one of the most impressive performances of his career against rival Iowa."
    },
    {
      "rank": 20,
      "first_name": "Mike",
      "last_name": "Washington",
      "college": "Arkansas",
      "position": "RB",
      "description": "6-1, 227 lbs. Went from Buffalo to New Mexico State to Arkansas. Described as 'super explosive.' Expected to run the 40 in the 4.4s. Will be in the running for pound-for-pound best tester among running backs."
    },
    {
      "rank": 21,
      "first_name": "Malachi",
      "last_name": "Fields",
      "college": "Notre Dame",
      "position": "WR",
      "description": "6-4, 218 lbs. No. 66 on 2024 Freaks List (while at Virginia). Close-grip bench pressed 365 lbs, 21 reps of 225. Vertical jumped 38 inches, broad jumped 10-7.5. Pro agility 4.18, 3-cone drill 6.81. Caught 36 passes for 630 yards and 5 TDs for the Irish in 2025."
    },
    {
      "rank": 22,
      "first_name": "Jaren",
      "last_name": "Kanak",
      "college": "Oklahoma",
      "position": "TE",
      "description": "6-1, 233 lbs. Converted linebacker who had 44 receptions for 533 yards in 2025. Will be one of the fastest guys at the combine. Ran a blistering 10.37 100 meters in high school. Expected to jump around 40 inches in the vertical."
    },
    {
      "rank": 23,
      "first_name": "George",
      "last_name": "Gumbs",
      "college": "Florida",
      "position": "EDGE",
      "description": "6-4, 245 lbs. Spent three seasons at NIU before two years at UF. Had 14.5 TFLs and 7.5 sacks. Chicago native with long arms and body fat south of 5 percent. Expected elite short shuttle times and vertical jump. Broad jump expected around 10-4."
    },
    {
      "rank": 24,
      "first_name": "Francis",
      "last_name": "Mauigoa",
      "college": "Miami",
      "position": "OL",
      "description": "6-6, 335 lbs. Former five-star recruit. No. 16 on 2025 Freaks List. Clocked 1.57 flying 10-yard split. Power output registered almost 10,000 watts (by far most on team, ~1,000 watts more than next player). Vertical jumped 30.5 inches."
    },
    {
      "rank": 25,
      "first_name": "Jeremiyah",
      "last_name": "Love",
      "college": "Notre Dame",
      "position": "RB",
      "description": "6-0, 214 lbs. Best running back in college football. Former Missouri state 100-meter champion who ran 10.76 in high school. Tremendous explosiveness and athleticism. Was not on 2025 Freaks List because he was in recovery phase during offseason testing."
    },
    {
      "rank": 26,
      "first_name": "John Michael",
      "last_name": "Gyllenborg",
      "college": "Wyoming",
      "position": "TE",
      "description": "6-5, 250 lbs. No. 54 on 2025 Freaks List. Former high school basketball star. Vertical jumped 37 inches, broad jumped 10-8, hit 21.6 mph on GPS. Only played one season of football before college. Still pretty raw. Had 24 catches for 217 yards and 1 TD in 2025."
    },
    {
      "rank": 27,
      "first_name": "Chris",
      "last_name": "Hilton Jr.",
      "college": "LSU",
      "position": "WR",
      "description": "6-0, 190 lbs. No. 32 on 2025 Freaks List. Former high school track star and three-time Louisiana state high jump champion. Hit 23.7 mph on GPS (all-time LSU record). Clocked 1.37 10-yard split off 1-yard lead-in (program record). Timed in high 4.2s in the 40."
    },
    {
      "rank": 28,
      "first_name": "Darrell",
      "last_name": "Jackson",
      "college": "Florida State",
      "position": "DT",
      "description": "6-5, 330 lbs. No. 5 on 2024 Freaks List. Finished career on high note with career-best 45 tackles and 3 TFLs. 36-inch arm length, 11-inch hands. Clocked at 20.6 mph in pads. Strength coach said some agility test results would be good for tight ends and linebackers."
    },
    {
      "rank": 29,
      "first_name": "Parker",
      "last_name": "Brailsford",
      "college": "Alabama",
      "position": "C",
      "description": "6-2, 290 lbs. Washington transfer. No. 20 on 2025 Freaks List. Bench pressed 505 lbs, power cleaned 385 lbs, squatted 675 lbs. Vertical jumped 33 inches, broad jumped 9-5, hit 19.47 mph on GPS."
    },
    {
      "rank": 30,
      "first_name": "Zachariah",
      "last_name": "Branch",
      "college": "Georgia",
      "position": "WR",
      "description": "5-10, 180 lbs. No. 49 on 2024 Freaks List (while at USC). Caught 81 passes for 811 yards and 6 TDs in 2025 at UGA. Clocked at well over 23 mph. Had 10-yard split of 1.44 seconds."
    },
    {
      "rank": 31,
      "first_name": "Marlin",
      "last_name": "Klein",
      "college": "Michigan",
      "position": "TE",
      "description": "6-6, 250 lbs. No. 35 on 2025 Freaks List (up from No. 90 in 2024). Hit 21.75 MPH, broad jumped 9-7. Ran 6.89 3-cone drill (faster than any TE at 2025 combine). 4.25 shuttle (also fastest by any TE at combine). Had 24 catches for 248 yards and 1 TD."
    },
    {
      "rank": 32,
      "first_name": "Dillon",
      "last_name": "Thieneman",
      "college": "Oregon",
      "position": "DB",
      "description": "No. 96 on 2024 Freaks List as a 207-lb 19-year-old at Purdue. Hit 22.37 mph, clocked 4.03 pro agility. Did Turkish get-up with 135 lbs and Romanian deadlift of 315 lbs for 5 reps. Made 44 tackles with 2 INTs for the Ducks. Expected to hit around 40 inches in vertical with excellent shuttle numbers."
    },
    {
      "rank": 33,
      "first_name": "Jalen",
      "last_name": "Walthall",
      "college": "Incarnate Word",
      "position": "WR",
      "description": "6-1.5, 198 lbs. No. 94 on 2025 Freaks List. Won Texas state title in triple jump with 50 feet 4 inches in high school. Began career at Hawaii. Vertical jumped 40 inches, broad jumped 10-7. 155 catches for 22 TDs over past two seasons."
    },
    {
      "rank": 34,
      "first_name": "Grayson",
      "last_name": "Halton",
      "college": "Oklahoma",
      "position": "DL",
      "description": "6-2, 293 lbs. Team captain for the Sooners' salty defense. Had 7 TFLs, 3.5 sacks and team-high 7 QB hurries. May run the 40 in the 4.8s."
    },
    {
      "rank": 35,
      "first_name": "Gabe",
      "last_name": "Jacas",
      "college": "Illinois",
      "position": "EDGE",
      "description": "6-3, 270 lbs. No. 59 on 2025 Freaks List. Former state champion wrestler from Florida. Dropped body fat from 12% to 5%. Led Big Ten in 2025 with 11 sacks, also had 3 forced fumbles. Bench pressed 225 lbs for over 30 reps, hit 20 mph on GPS."
    },
    {
      "rank": 36,
      "first_name": "Kyle",
      "last_name": "Louis",
      "college": "Pitt",
      "position": "LB",
      "description": "6-0, 225 lbs. No. 65 on 2025 Freaks List. Looked very good at Senior Bowl. Clocked 21.34 mph in-game on a 59-yard pick six against Syracuse in 2024. Broad jumped 10-3."
    },
    {
      "rank": 37,
      "first_name": "Eli",
      "last_name": "Raridon",
      "college": "Notre Dame",
      "position": "TE",
      "description": "6-6, 255 lbs. No. 85 on 2025 Freaks List. Caught 32 passes for 482 yards. Vertical jumped 34 inches, broad jumped 9-10."
    },
    {
      "rank": 38,
      "first_name": "Emmanuel",
      "last_name": "Pregnon",
      "college": "Oregon",
      "position": "OL",
      "description": "6-5, 320 lbs. No. 84 on 2024 Freaks List (while at USC). Bench pressed 10 reps of 315 lbs. Ran 1.68 10-yard split. Will be one of the strongest men at the combine."
    },
    {
      "rank": 39,
      "first_name": "Cole",
      "last_name": "Payton",
      "college": "North Dakota State",
      "position": "QB",
      "description": "6-3, 235 lbs. No. 95 on 2024 Freaks List. Vertical jumped 38 inches, broad jumped 10-0. Comparisons to Taysom Hill. In 2025: 72% completion rate, 16 TD passes, 4 INTs, 777 rushing yards and 13 rushing TDs."
    },
    {
      "rank": 40,
      "first_name": "David",
      "last_name": "Gusta",
      "college": "Kentucky",
      "position": "DL",
      "description": "6-3, 313 lbs. Former Washington State Cougar. Had 3 TFLs while starting 12 games for Kentucky. Expected to rep in high 30s at 225 on bench. Decent shot at running 40 in high 4.9s and vertical jumping around 32 inches."
    }
  ]
}
